cocoasuny/LIS3DH/STM32_HW6.0/Source/Drivers/lis3dh_driver.c
/******************** (C) COPYRIGHT 2012 STMicroelectronics ********************
* File Name          : LIS3DH_driver.c
* Author             : MSH Application Team
* Version            : $Revision:$
* Date               : $Date:$
* Description        : LIS3DH driver file
*                      
* HISTORY:
* Date               |	Modification                    |	Author

********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* THIS SOFTWARE IS SPECIFICALLY DESIGNED FOR EXCLUSIVE USE WITH ST PARTS.
*
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "lis3dh_driver.h"
#include "stm32l1xx.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

#define LIS3DH_CS_LOW()       GPIO_ResetBits(LIS_SPI_CS_Port, LIS_SPI_CS_Pin )
#define LIS3DH_CS_HIGH()      GPIO_SetBits(LIS_SPI_CS_Port, LIS_SPI_CS_Pin)

/*******************************************************************************
* Function Name		: LIS3DH_SpiInit
* Description		: Generic Reading function. It must be fullfilled with either
*			    : I2C or SPI reading functions					
* Input			: Register Address
* Output		: Data Read
* Return		: Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
void LIS3DH_SpiInit(void) {
  
  SPI_InitTypeDef  SPI_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Enable SPI1 and GPIO clocks */
  RCC_AHBPeriphClockCmd(LIS_RCC_Port_SPI, ENABLE);
  RCC_APB2PeriphClockCmd(LIS_RCC_Periph_SPI , ENABLE);
  
  /* Connect PXx to SPI_SCK */
  GPIO_PinAFConfig(LIS_SPI_Port, LIS_SPI_SCK_SOURCE, LIS_SPI_AF);
  
  /* Connect PXx to SPI_MISO */
  GPIO_PinAFConfig(LIS_SPI_Port, LIS_SPI_MISO_SOURCE, LIS_SPI_AF); 
  
  /* Connect PXx to SPI_MOSI */
  GPIO_PinAFConfig(LIS_SPI_Port, LIS_SPI_MOSI_SOURCE, LIS_SPI_AF);  
  
  /* Configure SPI1 pins: SCK, MISO and MOSI */
  GPIO_InitStructure.GPIO_Pin = LIS_SPI_MISO_Pin | LIS_SPI_M0SI_Pin | LIS_SPI_SCK_Pin;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
  GPIO_Init(LIS_SPI_Port, &GPIO_InitStructure);
  
  
  /* SPI1 configuration */
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(LIS_SPI, &SPI_InitStructure);
  
  /* Enable SPI1  */
  SPI_Cmd(LIS_SPI, ENABLE);
  
  /* Configure GPIO PIN for Lis Chip select */
  GPIO_InitStructure.GPIO_Pin = LIS_SPI_CS_Pin;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
  GPIO_Init(LIS_SPI_CS_Port, &GPIO_InitStructure);
  
  /* Deselect : Chip Select high */
  GPIO_SetBits(LIS_SPI_Port, LIS_SPI_CS_Pin);
  
	
}

/*******************************************************************************
* Function Name  : LIS3DH_SPI_SendByte
* Description    : Sends a Byte through the SPI interface and return the
*                  Byte received from the SPI bus.
* Input          : Byte : Byte send.
* Output         : None
* Return         : The received byte value
*******************************************************************************/
unsigned char LIS3DH_SPI_SendByte(unsigned char byte)
{
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(LIS_SPI, SPI_I2S_FLAG_TXE) == RESET);
  
  /* Send Half Word through the SPI1 peripheral */
  SPI_I2S_SendData(LIS_SPI, byte);
  
  /* Wait to receive a Half Word */
  while (SPI_I2S_GetFlagStatus(LIS_SPI, SPI_I2S_FLAG_RXNE) == RESET);
  
  /* Return the Half Word read from the SPI bus */
  return (unsigned char)SPI_I2S_ReceiveData(LIS_SPI);
}

/*******************************************************************************
* Function Name		: LIS3DH_ReadReg
* Description		: Generic Reading function. It must be fullfilled with either
*			: I2C or SPI reading functions					
* Input			: Register Address
* Output		: Data REad
* Return		: None
*******************************************************************************/
u8_t LIS3DH_ReadReg(u8_t Reg, u8_t* Data) {
    
  Reg |= 0x80;
  
  LIS3DH_CS_LOW();
  
  LIS3DH_SPI_SendByte(Reg);
  
  *Data=LIS3DH_SPI_SendByte(0x00);
  
  LIS3DH_CS_HIGH();
  
  return MEMS_SUCCESS;
}


/*******************************************************************************
* Function Name		: LIS3DH_WriteReg
* Description		: Generic Writing function. It must be fullfilled with either
*			: I2C or SPI writing function
* Input			: Register Address, Data to be written
* Output		: None
* Return		: None
*******************************************************************************/
u8_t LIS3DH_WriteReg(u8_t WriteAddr, u8_t Data) {
  
